module.exports = {
    "01/01": [
        { title: "آغاز نوروز", isHoliday: true },
    ],
    "01/02": [
        { title: "عید نوروز", isHoliday: true },
        { title: "هجوم مأموران ستم‌شاهی پهلوی به مدرسه‌ی فیضیه‌ی قم (۱۳۴۲ ه‍.ش)", isHoliday: false },
        { title: "آغاز عملیات فتح‌المبین (۱۳۶۱ ه‍.ش)", isHoliday: false },
    ],
    "01/03": [
        { title: "عید نوروز", isHoliday: true },
    ],
    "01/04": [
        { title: "عید نوروز", isHoliday: true },
    ],
    "01/07": [
        { title: "روز هنرهای نمایشی", isHoliday: false },
    ],
    "01/12": [
        { title: "روز جمهوری اسلامی ایران", isHoliday: true },
    ],
    "01/13": [
        { title: "روز طبیعت", isHoliday: true },
    ],
    "01/15": [
        { title: "روز ذخایر ژنتیکی و زیستی", isHoliday: false },
    ],
    "01/18": [
        { title: "روز سلامتی", isHoliday: false },
    ],
    "01/19": [
        { title: "شهادت آیت‌اللّه سیدمحمدباقر صدر و خواهر ایشان بنت‌الهدی به دست حکومت بعث عراق (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "01/20": [
        { title: "روز ملّی فنّاوری هسته‌ای", isHoliday: false },
        { title: "روز هنر انقلاب اسلامی (سالروز شهادت سیدمرتضی آوینی) (۱۳۷۲ ه‍.ش)", isHoliday: false },
    ],
    "01/21": [
        { title: "شهادت امیر سپهبد علی صیاد شیرازی (۱۳۷۸ ه‍.ش)", isHoliday: false },
        { title: "سالروز افتتاح حساب شماره‌ی ۱۰۰ به فرمان امام خمینی (رحمة‌اللّه علیه) و تأسیس بنیاد مسکن انقلاب اسلامی (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "01/25": [
        { title: "روز بزرگداشت عطّار نیشابوری  ‌", isHoliday: false },
    ],
    "01/29": [
        { title: "روز ارتش جمهوری اسلامی و نیروی زمینی", isHoliday: false },
    ],
    "02/01": [
        { title: "روز بزرگداشت سعدی", isHoliday: false },
    ],
    "02/02": [
        { title: "تأسیس سپاه پاسداران انقلاب اسلامی (۱۳۵۸ ه‍.ش)", isHoliday: false },
        { title: "سالروز اعلام انقلاب فرهنگی (۱۳۵۹ ه‍.ش)", isHoliday: false },
        { title: "روز زمین پاک", isHoliday: false },
    ],
    "02/03": [
        { title: "روز بزرگداشت شیخ بهایی", isHoliday: false },
        { title: "روز معماری", isHoliday: false },
        { title: "سالروز شهادت امیر سپهبد قرنی (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "02/05": [
        { title: "شکست حمله نظامی آمریکا به ایران در طبس (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "02/07": [
        { title: "روز ایمنی حمل و نقل", isHoliday: false },
    ],
    "02/09": [
        { title: "روز شوراها", isHoliday: false },
    ],
    "02/10": [
        { title: "روز ملی خلیج فارس", isHoliday: false },
        { title: "آغاز عملیات بیت المقدس (۱۳۶۱ ه‍.ش)", isHoliday: false },
    ],
    "02/12": [
        { title: "شهادت استاد مرتضی مطهری و روز معلم (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "02/15": [
        { title: "روز بزرگداشت شیخ صدوق", isHoliday: false },
    ],
    "02/18": [
        { title: "روز بیماری‌های خاص و صعب‌العلاج", isHoliday: false },
    ],
    "02/19": [
        { title: "روز بزرگداشت شیخ کلینی", isHoliday: false },
        { title: "روز اسناد ملی و میراث مکتوب", isHoliday: false },
    ],
    "02/24": [
        { title: "لغو امتیاز تنباکو به فتوای آیت‌اللّه میرزا حسن شیرازی (۱۲۷۰ ه‍.ش)", isHoliday: false },
    ],
    "02/25": [
        { title: "روز پاسداشت زبان فارسی و بزرگداشت حکیم ابوالقاسم فردوسی", isHoliday: false },
    ],
    "02/27": [
        { title: "روز ارتباطات و روابط عمومی", isHoliday: false },
    ],
    "02/28": [
        { title: "روز بزرگداشت حکیم عمر خیام", isHoliday: false },
    ],
    "02/30": [
        { title: "روز ملی جمعیت", isHoliday: false },
    ],
    "02/31": [
        { title: "روز اهدای عضو، اهدای زندگی", isHoliday: false },
    ],
    "03/01": [
        { title: "روز بهره‌وری و بهینه‌سازی مصرف", isHoliday: false },
        { title: "روز بزرگداشت ملّاصدرا (صدرالمتألهین)", isHoliday: false },
    ],
    "03/03": [
        { title: "فتح خرمشهر در عملیات بیت‌المقدس و روز مقاومت، ایثار و پیروزی (۱۳۶۱ ه‍.ش)", isHoliday: false },
    ],
    "03/04": [
        { title: "روز دزفول", isHoliday: false },
        { title: "روز مقاومت و پایداری", isHoliday: false },
    ],
    "03/05": [
        { title: "روز نسیم مهر (روز حمایت از خانواده زندانیان)", isHoliday: false },
    ],
    "03/07": [
        { title: "افتتاح اولین دوره‌ی مجلس شورای اسلامی (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "03/14": [
        { title: "رحلت حضرت امام خمینی (رحمة‌اللّه علیه) رهبر کبیر انقلاب و بنیان‌گذار جمهوری اسلامی ایران (۱۳۶۸ ه‍.ش)", isHoliday: true },
        { title: "انتخاب حضرت آیت‌اللّه امام خامنه‌ای به رهبری (۱۳۶۸ ه‍.ش)", isHoliday: false },
    ],
    "03/15": [
        { title: "قیام خونین ۱۵ خرداد (۱۳۴۲ ه‍.ش)", isHoliday: true },
        { title: "زندانی شدن حضرت امام خمینی (رحمة‌اللّه علیه) به دست مأموران ستم‌شاهی پهلوی", isHoliday: false },
    ],
    "03/20": [
        { title: "روز صنایع دستی", isHoliday: false },
        { title: "شهادت آیت‌اللّه سعیدی به دست مأموران ستم‌شاهی پهلوی (۱۳۴۹ ه‍.ش)", isHoliday: false },
    ],
    "03/26": [
        { title: "شهادت سربازان دلیر اسلام :بخارایی، امانی، صفار هرندی و نیک‌نژاد (۱۳۴۴ ه‍.ش)", isHoliday: false },
    ],
    "03/27": [
        { title: "روز جهاد کشاورزی (تشکیل جهاد سازندگی به فرمان حضرت امام خمینی رحمة‌اللّه علیه) (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "03/29": [
        { title: "درگذشت دکتر علی شریعتی (۱۳۵۶ ه‍.ش)", isHoliday: false },
    ],
    "03/30": [
        { title: "شهادت زائران حرم رضوی علیه‌السلام به دست ایادی آمریکا در روز عاشورا (۱۳۷۳ ه‍.ش)", isHoliday: false },
    ],
    "03/31": [
        { title: "شهادت دکتر مصطفی چمران (۱۳۶۰ ه‍.ش)", isHoliday: false },
        { title: "روز بسیج استادان", isHoliday: false },
    ],
    "04/01": [
        { title: "روز تبلیغ و اطلاع‌رسانی دینی (سالروز صدور فرمان امام خمینی رحمة‌اللّه علیه مبنی بر تأسیس سازمان تبلیغات اسلامی) (۱۳۶۰ ه‍.ش)", isHoliday: false },
        { title: "روز اصناف", isHoliday: false },
    ],
    "04/07": [
        { title: "شهادت مظلومانه‌ی آیت‌اللّه دکتر بهشتی و ۷۲ تن از یاران امام با انفجار بمب به دست منافقان در دفتر مرکزی حزب جمهوری اسلامی (۱۳۶۰ ه‍.ش)", isHoliday: false },
        { title: "روز قوه‌ی قضائیه", isHoliday: false },
        { title: "سالروز بمباران شیمیایی شهر سردشت (۱۳۶۶ ه‍.ش)", isHoliday: false },
    ],
    "04/08": [
        { title: "‌روز مبارزه با سلاح‌های شیمیایی و میکروبی", isHoliday: false },
    ],
    "04/10": [
        { title: "روز صنعت و معدن", isHoliday: false },
        { title: "روز آزادسازی شهر مهران", isHoliday: false },
        { title: "روز بزرگداشت صائب تبریزی", isHoliday: false },
    ],
    "04/11": [
        { title: "شهادت آیت‌اللّه صدوقی چهارمین شهید محراب به دست منافقان (۱۳۶۱ ه‍.ش)", isHoliday: false },
    ],
    "04/12": [
        { title: "حمله‌ی ددمنشانه‌ی ناوگان آمریکای جنایتکار به هواپیمای مسافربری جمهوری اسلامی ایران (۱۳۶۷ ه‍.ش)", isHoliday: false },
        { title: "روز افشای حقوق بشر آمریکایی", isHoliday: false },
        { title: "روز بزرگداشت علامه امینی (۱۳۴۹ ه‍.ش)", isHoliday: false },
    ],
    "04/14": [
        { title: "روز قلم", isHoliday: false },
        { title: "روز شهرداری و دهیاری", isHoliday: false },
    ],
    "04/16": [
        { title: "روز مالیات", isHoliday: false },
    ],
    "04/18": [
        { title: "روز ادبیات کودکان و نوجوانان", isHoliday: false },
        { title: "کشف توطئه‌ی آمریکایی در پایگاه هوایی شهید نوژه (کودتای نافرجام نقاب) (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "04/21": [
        { title: "روز عفاف و حجاب", isHoliday: false },
        { title: "حمله به مسجد گوهرشاد و کشتار مردم به دست رضاخان (۱۳۱۴ ه‍.ش)", isHoliday: false },
    ],
    "04/23": [
        { title: "گشایش نخستین مجلس خبرگان رهبری (۱۳۶۲ ه‍.ش)", isHoliday: false },
    ],
    "04/25": [
        { title: "روز بهزیستی و تأمین اجتماعی", isHoliday: false },
    ],
    "04/26": [
        { title: "سالروز تأسیس نهاد شورای نگهبان (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "04/27": [
        { title: "اعلام پذیرش قطعنامه‌ی ۵۹۸ شورای امنیت از سوی ایران (۱۳۶۷ ه‍.ش)", isHoliday: false },
    ],
    "04/30": [
        { title: "روز بزرگداشت آیت‌اللّه سید ابوالقاسم کاشانی", isHoliday: false },
    ],
    "05/04": [
        { title: "روز بزرگداشت شیخ صفی‌الدین اردبیلی", isHoliday: false },
    ],
    "05/05": [
        { title: "سالروز عملیات افتخار‌آفرین مرصاد (۱۳۶۷ ه‍.ش)", isHoliday: false },
    ],
    "05/06": [
        { title: "روز کارآفرینی و آموزش‌های فنّی‌و‌حرفه‌ای", isHoliday: false },
    ],
    "05/08": [
        { title: "روز بزرگداشت شیخ شهاب‌الدین سهروردی (شیخ اشراق)", isHoliday: false },
    ],
    "05/09": [
        { title: "روز اهدای خون", isHoliday: false },
    ],
    "05/11": [
        { title: "شهادت آیت‌اللّه شیخ فضل‌اللّه نوری (۱۲۸۸ ه‍.ش)", isHoliday: false },
    ],
    "05/14": [
        { title: "صدور فرمان مشروطیت (۱۲۸۵ ه‍.ش)", isHoliday: false },
        { title: "روز حقوق بشر اسلامی و کرامت انسانی", isHoliday: false },
    ],
    "05/15": [
        { title: "سالروز شهادت امیر سرلشکر خلبان عباس بابایی (۱۳۶۶ ه‍.ش)", isHoliday: false },
    ],
    "05/16": [
        { title: "تشکیل جهاد دانشگاهی (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "05/17": [
        { title: "روز خبرنگار", isHoliday: false },
    ],
    "05/18": [
        { title: "روز بزرگداشت شهدای مدافع حرم", isHoliday: false },
    ],
    "05/21": [
        { title: "روز حمایت از صنایع کوچک", isHoliday: false },
    ],
    "05/22": [
        { title: "روز تشکّل‌ها و مشارکت‌های اجتماعی", isHoliday: false },
    ],
    "05/23": [
        { title: "روز مقاومت اسلامی", isHoliday: false },
    ],
    "05/26": [
        { title: "آغاز بازگشت آزادگان به میهن اسلامی (۱۳۶۹ ه‍.ش)", isHoliday: false },
    ],
    "05/28": [
        { title: "کودتای آمریکا برای بازگرداندن شاه (۱۳۳۲ ه‍.ش)", isHoliday: false },
        { title: "گشایش مجلس خبرگان برای بررسی نهایی قانون اساسی جمهوری اسلامی ایران (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "05/30": [
        { title: "روز بزرگداشت علامه مجلسی", isHoliday: false },
    ],
    "05/31": [
        { title: "روز صنعت دفاعی", isHoliday: false },
    ],
    "06/01": [
        { title: "روز بزرگداشت ابوعلی سینا", isHoliday: false },
        { title: "روز پزشک", isHoliday: false },
    ],
    "06/02": [
        { title: "آغاز هفته‌ی دولت", isHoliday: false },
        { title: "شهادت سید‌علی اندرزگو (در روز ۱۹ ماه مبارک رمضان) (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "06/03": [
        { title: "اِشغال ایران توسّط متّفقین و فرار رضاخان (۱۳۲۰ ه‍.ش)", isHoliday: false },
    ],
    "06/04": [
        { title: "روز کارمند", isHoliday: false },
    ],
    "06/05": [
        { title: "روز بزرگداشت محمّدبن زکریای رازی", isHoliday: false },
        { title: "روز داروسازی", isHoliday: false },
        { title: "روز کشتی", isHoliday: false },
    ],
    "06/08": [
        { title: "روز مبارزه با تروریسم (انفجار دفتر نخست‌وزیری به دست منافقان و شهادت مظلومانه‌ی شهیدان رجایی و باهنر) (۱۳۶۰ ه‍.ش)", isHoliday: false },
    ],
    "06/10": [
        { title: "روز بانکداری اسلامی (سالروز تصویب قانون عملیات بانکی بدون ربا) (۱۳۶۲ ه‍.ش)", isHoliday: false },
        { title: "روز تشکیل قرارگاه پدافند هوایی حضرت خاتم‌الانبیا صلی اللّه علیه و آله (۱۳۷۱ ه‍.ش)", isHoliday: false },
    ],
    "06/11": [
        { title: "روز صنعت چاپ", isHoliday: false },
    ],
    "06/12": [
        { title: "روز مبارزه بااستعمار انگلیس (سالروز شهادت رئیسعلی دلواری - ۱۲۹۴ هـ.ش)", isHoliday: false },
        { title: "روز بهوَرز", isHoliday: false },
    ],
    "06/13": [
        { title: "روز تعاون", isHoliday: false },
        { title: "روز بزرگداشت ابوریحان بیرونی", isHoliday: false },
        { title: "روز مردم‌شناسی", isHoliday: false },
    ],
    "06/14": [
        { title: "شهادت آیت‌اللّه قدّوسی و سرتیپ وحید دستجردی (۱۳۶۰ ه‍.ش)", isHoliday: false },
    ],
    "06/17": [
        { title: "قیام ۱۷ شهریور و کشتار جمعی از مردم به‌دست مأموران ستم‌شاهی پهلوی (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "06/19": [
        { title: "وفات آیت‌اللّه سیدمحمود طالقانی اوّلین امام جمعه‌ی تهران (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "06/20": [
        { title: "شهادت دومین شهید محراب آیت‌اللّه مدنی به دست منافقان (۱۳۶۰ ه‍.ش)", isHoliday: false },
    ],
    "06/21": [
        { title: "روز سینما", isHoliday: false },
    ],
    "06/27": [
        { title: "روز شعر و ادب فارسی", isHoliday: false },
        { title: "روز بزرگداشت استاد سید‌محمّد‌حسین شهریار", isHoliday: false },
    ],
    "06/31": [
        { title: "آغاز جنگ تحمیلی (۱۳۵۹ ه‍.ش)", isHoliday: false },
        { title: "آغاز هفته‌ی دفاع مقدّس", isHoliday: false },
    ],
    "07/05": [
        { title: "شکست حصر آبادان در عملیات ثامن‌الائمه علیه‌السلام (۱۳۶۰ ه‍.ش)", isHoliday: false },
    ],
    "07/07": [
        { title: "روز بزرگداشت فرماندهان شهید دفاع مقدّس", isHoliday: false },
        { title: "‌شهادت سرداران اسلام: فلاحی، فکوری، نامجو، کلاهدوز و جهان‌آرا (۱۳۶۰ ه‍.ش)", isHoliday: false },
        { title: "روز آتش‌نشانی و ایمنی", isHoliday: false },
        { title: "روز بزرگداشت شمس", isHoliday: false },
    ],
    "07/08": [
        { title: "روز بزرگداشت مولوی", isHoliday: false },
    ],
    "07/09": [
        { title: "روز همبستگی و همدردی با کودکان و نوجوانان فلسطینی", isHoliday: false },
    ],
    "07/13": [
        { title: "هجرت حضرت امام خمینی (رحمة‌اللّه علیه) از عراق به پاریس (۱۳۵۷ ه‍.ش)", isHoliday: false },
        { title: "روز نیروی انتظامی", isHoliday: false },
    ],
    "07/14": [
        { title: "روز دامپزشکی", isHoliday: false },
    ],
    "07/15": [
        { title: "روز روستا و عشایر", isHoliday: false },
    ],
    "07/20": [
        { title: "روز بزرگداشت حافظ", isHoliday: false },
    ],
    "07/23": [
        { title: "شهادت پنجمین شهید محراب آیت‌اللّه اشرفی اصفهانی به دست منافقان (۱۳۶۱ ه‍.ش)", isHoliday: false },
    ],
    "07/24": [
        { title: "روز ملی پارالمپیک", isHoliday: false },
        { title: "روز پیوند اولیا و مربیان", isHoliday: false },
        { title: "سالروز واقعه‌ی به‌آتش‌کشیدن مسجد جامع شهر کرمان به دست دژخیمان حکومت پهلوی (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "07/26": [
        { title: "روز تربیت‌بدنی و ورزش", isHoliday: false },
    ],
    "07/29": [
        { title: "روز صادرات", isHoliday: false },
    ],
    "08/01": [
        { title: "شهادت مظلومانه‌ی آیت‌اللّه حاج سید مصطفی خمینی (۱۳۵۶ ه‍.ش)", isHoliday: false },
        { title: "روز آمار و برنامه‌ریزی", isHoliday: false },
    ],
    "08/04": [
        { title: "اعتراض و افشاگری حضرت امام خمینی (ره) علیه پذیرش کاپیتولاسیون (۱۳۴۳ ه‍.ش)", isHoliday: false },
    ],
    "08/08": [
        { title: "شهادت محمّدحسین فهمیده (بسیجی ۱۳ ساله) (۱۳۵۹ ه‍.ش)", isHoliday: false },
        { title: "روز نوجوان و بسیج دانش‌آموزی", isHoliday: false },
        { title: "روز پدافند غیرعامل", isHoliday: false },
    ],
    "08/10": [
        { title: "شهادت آیت‌اللّه قاضی طباطبایی، اوّلین شهید محراب به دست منافقان (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "08/13": [
        { title: "تسخیر لانه‌ی جاسوسی آمریکا به دست دانشجویان پیرو خط امام (۱۳۵۸ ه‍.ش)", isHoliday: false },
        { title: "روز ملی مبارزه با استکبار جهانی", isHoliday: false },
        { title: "روز دانش‌آموز", isHoliday: false },
        { title: "تبعید حضرت امام خمینی (رحمة‌اللّه علیه) از ایران به ترکیه (۱۳۴۳ ه‍.ش)", isHoliday: false },
    ],
    "08/14": [
        { title: "روز فرهنگ عمومی", isHoliday: false },
    ],
    "08/18": [
        { title: "روز کیفیت", isHoliday: false },
    ],
    "08/24": [
        { title: "روز کتاب، کتاب‌خوانی و کتابدار", isHoliday: false },
        { title: "روز بزرگداشت آیت‌اللّه علامه سیدمحمّدحسین طباطبایی (۱۳۶۰ ه‍.ش)", isHoliday: false },
    ],
    "08/26": [
        { title: "سالروز آزادسازی سوسنگرد (۱۳۵۹ ه‍.ش)", isHoliday: false },
    ],
    "09/05": [
        { title: "روزبسیج مستضعفان (تشکیل بسیج مستضعفان به فرمان حضرت امام خمینی رحمة‌اللّه علیه) (۱۳۵۸ ه‍.ش)", isHoliday: false },
        { title: "سالروز قیام مردم گرگان (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "09/07": [
        { title: "روز نیروی دریایی", isHoliday: false },
    ],
    "09/09": [
        { title: "روز بزرگداشت شیخ مفید", isHoliday: false },
    ],
    "09/10": [
        { title: "شهادت آیت‌اللّه سید‌حسن مدرّس و روز مجلس (۱۳۱۶ ه‍.ش)", isHoliday: false },
    ],
    "09/11": [
        { title: "شهادت میرزا‌کوچک‌خان جنگلی (۱۳۰۰ ه‍.ش)", isHoliday: false },
    ],
    "09/12": [
        { title: "روز قانون اساسی جمهوری اسلامی ایران (تصویب قانون اساسی جمهوری اسلامی ایران) (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "09/13": [
        { title: "روز بیمه", isHoliday: false },
    ],
    "09/16": [
        { title: "روز دانشجو", isHoliday: false },
    ],
    "09/18": [
        { title: "معرّفی عراق به عنوان مسئول و آغازگر جنگ از سوی سازمان ملل (۱۳۷۰ ه‍.ش)", isHoliday: false },
    ],
    "09/19": [
        { title: "تشکیل شورای عالی انقلاب فرهنگی به فرمان حضرت امام خمینی (رحمة‌اللّه علیه) (۱۳۶۳ ه‍.ش)", isHoliday: false },
    ],
    "09/20": [
        { title: "شهادت آیت‌اللّه دستغیب، سومین شهید محراب به دست منافقان (۱۳۶۰ ه‍.ش)", isHoliday: false },
    ],
    "09/25": [
        { title: "روز پژوهش", isHoliday: false },
    ],
    "09/26": [
        { title: "روز حمل‌و‌نقل و رانندگان", isHoliday: false },
    ],
    "09/27": [
        { title: "شهادت آیت‌اللّه دکتر محمّد مفتّح (۱۳۵۸ ه‍.ش)", isHoliday: false },
        { title: "روز وحدت حوزه و دانشگاه", isHoliday: false },
    ],
    "09/29": [
        { title: "روز تجلیل از شهید تندگویان", isHoliday: false },
    ],
    "09/30": [
        { title: "شب یلدا", isHoliday: false },
    ],
    "10/03": [
        { title: "روز ثبت‌احوال", isHoliday: false },
    ],
    "10/05": [
        { title: "روز ایمنی در برابر زلزله و کاهش اثرات بلایای طبیعی", isHoliday: false },
    ],
    "10/07": [
        { title: "سالروز تشکیل نهضت سوادآموزی به فرمان حضرت امام خمینی (رحمة‌اللّه علیه) (۱۳۵۸ ه‍.ش)", isHoliday: false },
        { title: "شهادت آیت‌اللّه حسین غفّاری به دست مأموران ستم‌شاهی پهلوی (۱۳۵۳ ه‍.ش)", isHoliday: false },
    ],
    "10/08": [
        { title: "روز صنعت پتروشیمی", isHoliday: false },
    ],
    "10/09": [
        { title: "روز بصیرت و میثاق امّت با ولایت (سالروز حماسه‌ی ۹ دی ۸۸)", isHoliday: false },
    ],
    "10/13": [
        { title: "روز جهانی مقاومت - شهادت الگوی اخلاص و عمل، سردار سپهبد حاج قاسم سلیمانی و هم‌رزمان ایشان به دست استکبار جهانی (۱۳۹۸ ه‍.ش)", isHoliday: false },
        { title: "ابلاغ پیام تاریخی حضرت امام خمینی (ره) به گورباچف رهبر شوروی سابق (۱۳۶۷ ه‍.ش)", isHoliday: false },
    ],
    "10/17": [
        { title: "اجرای طرح استعماری حذف حجاب (کشف حجاب) به دست رضاخان دیکتاتور (۱۳۱۴ ه‍.ش)", isHoliday: false },
        { title: "روز بزرگداشت خواجوی کرمانی", isHoliday: false },
    ],
    "10/19": [
        { title: "قیام خونین مردم قم (۱۳۵۶ ه‍.ش)", isHoliday: false },
    ],
    "10/20": [
        { title: "شهادت میرزا تقی خان امیرکبیر (۱۲۳۰ ه‍.ش)", isHoliday: false },
    ],
    "10/22": [
        { title: "تشکیل شورای انقلاب به فرمان حضرت امام خمینی (رحمة‌اللّه علیه) (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "10/26": [
        { title: "فرار شاه معدوم (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "10/27": [
        { title: "شهادت شهیدان: نواب صفوی، طهماسبی، برادران واحدی و ذوالقدر از فدائیان اسلام (۱۳۳۴ ه‍.ش)", isHoliday: false },
    ],
    "10/29": [
        { title: "روز غزه", isHoliday: false },
    ],
    "11/06": [
        { title: "سالروز حماسه‌ی مردم آمل", isHoliday: false },
    ],
    "11/12": [
        { title: "سالروز بازگشت حضرت امام خمینی (رحمة‌اللّه علیه) به ایران و آغاز دهه‌ی مبارک فجر انقلاب اسلامی", isHoliday: false },
    ],
    "11/14": [
        { title: "روز فنّاوری فضایی", isHoliday: false },
    ],
    "11/19": [
        { title: "روز نیروی هوایی", isHoliday: false },
    ],
    "11/21": [
        { title: "شکسته‌شدن حکومت‌نظامی به فرمان امام خمینی (رحمة‌اللّه علیه) (۱۳۵۷ ه‍.ش)", isHoliday: false },
    ],
    "11/22": [
        { title: "پیروزی انقلاب اسلامی ایران و سقوط نظام شاهنشاهی (۱۳۵۷ ه‍.ش)", isHoliday: true },
    ],
    "11/25": [
        { title: "صدور حکم تاریخی حضرت امام خمینی (رحمة‌اللّه علیه) مبنی بر ارتداد سلمان‌رشدی نویسنده‌ی خائن کتاب آیات شیطانی (۱۳۶۷ ه‍.ش)", isHoliday: false },
    ],
    "11/29": [
        { title: "قیام مردم تبریز به مناسبت چهلمین روز شهادت شهدای قم (۱۳۵۶ ه‍.ش)", isHoliday: false },
        { title: "روز اقتصاد مقاومتی و کارآفرینی", isHoliday: false },
    ],
    "12/03": [
        { title: "کودتای انگلیسی رضاخان (۱۲۹۹ ه‍.ش)", isHoliday: false },
    ],
    "12/05": [
        { title: "روز بزرگداشت خواجه‌نصیرالدّین طوسی", isHoliday: false },
        { title: "روز مهندسی", isHoliday: false },
    ],
    "12/08": [
        { title: "روز امور تربیتی و تربیت اسلامی", isHoliday: false },
        { title: "روز بزرگداشت حکیم حاج ملاهادی سبزواری", isHoliday: false },
    ],
    "12/09": [
        { title: "روز حمایت از حقوق مصرف‌کنندگان", isHoliday: false },
    ],
    "12/14": [
        { title: "روز احسان و نیکوکاری", isHoliday: false },
        { title: "روز ترویج فرهنگ قرض‌الحسنه", isHoliday: false },
    ],
    "12/15": [
        { title: "روز درختکاری", isHoliday: false },
    ],
    "12/18": [
        { title: "روز بزرگداشت سید‌جمال‌الدّین اسدآبادی", isHoliday: false },
        { title: "سالروز تأسیس کانون‌های فرهنگی‌و‌هنری مساجد کشور", isHoliday: false },
    ],
    "12/20": [
        { title: "روز راهیان نور", isHoliday: false },
    ],
    "12/21": [
        { title: "روز بزرگداشت نظامی گنجوی", isHoliday: false },
    ],
    "12/22": [
        { title: "روز بزرگداشت شهدا (سالروز صدور فرمان حضرت امام خمینی رحمة‌اللّه علیه، مبنی بر تأسیس بنیاد شهید انقلاب اسلامی) (۱۳۵۸ ه‍.ش)", isHoliday: false },
    ],
    "12/25": [
        { title: "بمباران شیمیایی حلبچه به دست ارتش بعث عراق (۱۳۶۶ ه‍.ش)", isHoliday: false },
    ],
    "12/29": [
        { title: "روز ملّی‌شدن صنعت نفت ایران (۱۳۲۹ ه‍.ش)", isHoliday: true },
    ],
    "12/30": [
        { title: "این روز فقط در سال‌های کبیسه وجود دارد و معمولاً تعطیل اعلام می‌گردد", isHoliday: true },
    ],
}